benchmarks/artillery_result_with_log.txt
Running scenarios...
Phase started: unnamed (index: 0, duration: 1s) 10:20:36(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 10:20:37(-0300)

--------------------------------------
Metrics for period to: 10:20:40(-0300) (width: 0.985s)
--------------------------------------

http.codes.200: ................................................................ 50
http.request_rate: ............................................................. 50/sec
http.requests: ................................................................. 50
http.response_time:
  min: ......................................................................... 3
  max: ......................................................................... 45
  median: ...................................................................... 4
  p95: ......................................................................... 8.9
  p99: ......................................................................... 44.3
http.responses: ................................................................ 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50


All VUs finished. Total time: 25 seconds

--------------------------------
Summary report @ 10:20:59(-0300)
--------------------------------

errors.ETIMEDOUT: .............................................................. 41
http.codes.200: ................................................................ 221
http.request_rate: ............................................................. 12/sec
http.requests: ................................................................. 221
http.response_time:
  min: ......................................................................... 3
  max: ......................................................................... 3332
  median: ...................................................................... 232.8
  p95: ......................................................................... 376.2
  p99: ......................................................................... 2780
http.responses: ................................................................ 221
vusers.completed: .............................................................. 9
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 41
vusers.session_length:
  min: ......................................................................... 21349.9
  max: ......................................................................... 22710.6
  median: ...................................................................... 21381.5
  p95: ......................................................................... 22254.1
  p99: ......................................................................... 22254.1